
INSERT INTO breed (name, breed_type) VALUES
                                         ('Акита-ину', 'LARGE'),
                                         ('Американский булли', 'MEDIUM'),
                                         ('Басенджи', 'MEDIUM'),
                                         ('Бигль', 'MEDIUM'),
                                         ('Бордер-колли', 'MEDIUM'),
                                         ('Бульдог', 'MEDIUM'),
                                         ('Бультерьер', 'MEDIUM'),
                                         ('Далматин', 'LARGE'),
                                         ('Доберман', 'LARGE'),
                                         ('Золотистый ретривер', 'LARGE'),
                                         ('Йоркширский терьер', 'SMALL'),
                                         ('Кане-корсо', 'LARGE'),
                                         ('Кокер-спаниель', 'MEDIUM'),
                                         ('Лабрадор', 'LARGE'),
                                         ('Мальтипу', 'SMALL'),
                                         ('Мопс', 'SMALL'),
                                         ('Немецкая овчарка', 'LARGE'),
                                         ('Пекинес', 'SMALL'),
                                         ('Померанский шпиц', 'SMALL'),
                                         ('Пудель', 'MEDIUM'),
                                         ('Ротвейлер', 'LARGE'),
                                         ('Самоед', 'LARGE'),
                                         ('Сенбернар', 'LARGE'),
                                         ('Сиба-ину', 'MEDIUM'),
                                         ('Стаффордширский терьер', 'MEDIUM'),
                                         ('Такса', 'SMALL'),
                                         ('Французский бульдог', 'SMALL'),
                                         ('Хаски', 'LARGE'),
                                         ('Чихуахуа', 'SMALL'),
                                         ('Шарпей', 'MEDIUM'),
                                         ('Ши-тцу', 'SMALL');

INSERT INTO service (name, description) VALUES
                                            ('Hygiene', 'Услуга включает стрижку когтей, вычесывание и бережное купание с использованием профессиональных средств для чистоты и здоровья вашего питомца. Идеально для регулярного поддержания гигиены!'),
                                            ('Grooming', 'Полный комплекс груминга: стрижку когтей, вычесывание, купание и профессиональную стрижку. Ваша собака или кошка получат уход, подчеркивающий их естественную красоту и поддерживающий здоровье шерсти и кожи.'),
                                            ('Grooming + Coloring', 'Полный комплекс груминга со стрижкой и окрашиванием. Безопасное временное окрашивание добавит яркости и индивидуальности вашему питомцу. Прекрасный вариант для особых случаев и фотосессий!');


INSERT INTO service_price (service_id, species, breed_type, price) VALUES
-- Hygiene
(1, 'Собака', 'SMALL', 1100),
(1, 'Собака', 'MEDIUM', 1300),
(1, 'Собака', 'LARGE', 1500),
(1, 'Кошка', NULL, 1200),

-- Grooming
(2, 'Собака', 'SMALL', 1300),
(2, 'Собака', 'MEDIUM', 1500),
(2, 'Собака', 'LARGE', 1700),
(2, 'Кошка', NULL, 1400),

-- Grooming + Coloring
(3, 'Собака', 'SMALL', 1700),
(3, 'Собака', 'MEDIUM', 1900),
(3, 'Собака', 'LARGE', 2100),
(3, 'Кошка', NULL, 1800);


INSERT INTO client (first_name, last_name, phone, password) VALUES
                                                                ('Анна', 'Сидорова', '+7 (917) 299-64-49', '$2a$10$IALDVRSNwEjD1B/BdY2WpuHTnm5oPRR4T3IRJzCYPDtDprlFPQvSa'), --qwerty
                                                                ('Иван', 'Петров', '+7 (917) 555-65-49', '$2a$10$IALDVRSNwEjD1B/BdY2WpuHTnm5oPRR4T3IRJzCYPDtDprlFPQvSa'), --qwerty
                                                                ('Мария', 'Иванова', '+7 (917) 444-44-49', '$2a$10$IALDVRSNwEjD1B/BdY2WpuHTnm5oPRR4T3IRJzCYPDtDprlFPQvSa'), --qwerty
                                                                ('Павел', 'Иванов', '+7 (917) 999-63-49', '$2a$10$IALDVRSNwEjD1B/BdY2WpuHTnm5oPRR4T3IRJzCYPDtDprlFPQvSa'); --qwerty


INSERT INTO groomer (first_name, last_name, career_start, email, phone) VALUES
                                                                            ('Иван', 'Иванов', '2020-01-01', 'ivan.groomer@example.com', '1112223333'),
                                                                            ('Мария', 'Петрова', '2019-05-15', 'maria.groomer@example.com', '4445556666');


INSERT INTO pet (name, species, breed_id, birth_date, owner_id) VALUES
                                                                    ('Бобик', 'Собака', 4, '2018-06-15', 1),
                                                                    ('Хани', 'Собака', 13, '2020-03-10', 2),
                                                                    ('Шарик', 'Собака', 10, '2019-11-21', 3),
                                                                    ('Пух', 'Кошка', NULL, '2021-05-05', 1),
                                                                    ('Рекс', 'Собака', 18, '2020-07-12', 4),
                                                                    ('Мурка', 'Кошка', NULL, '2022-02-28', 2);


INSERT INTO time_slot (groomer_id, start_time, end_time, taken) VALUES
-- Грумер 1
(1, '2025-07-01 09:00:00', '2025-07-01 11:00:00', false),
(1, '2025-07-01 11:00:00', '2025-07-01 13:00:00', false),
(1, '2025-07-01 13:00:00', '2025-07-01 15:00:00', false),
(1, '2025-07-02 10:00:00', '2025-07-02 12:00:00', false),
(1, '2025-07-02 12:00:00', '2025-07-02 14:00:00', false),

-- Грумер 2
(2, '2025-07-01 10:00:00', '2025-07-01 12:00:00', false),
(2, '2025-07-01 12:00:00', '2025-07-01 14:00:00', false),
(2, '2025-07-01 14:00:00', '2025-07-01 16:00:00', false),
(2, '2025-07-02 09:00:00', '2025-07-02 11:00:00', false),
(2, '2025-07-02 11:00:00', '2025-07-02 13:00:00', false);